riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
void setAllPortLow()
{
    //digitalWrite(PORT_SE_IN, LOW);
    digitalWrite(PORT_AB_IN, LOW);
    digitalWrite(PORT_A3_IN, LOW);
    digitalWrite(PORT_A2_IN, LOW);
    digitalWrite(PORT_A1_IN, LOW);
    digitalWrite(PORT_A0_IN, LOW);
    digitalWrite(PORT_DG_IN, LOW);
    digitalWrite(PORT_CLK_IN, LOW);
    digitalWrite(PORT_WE_IN, LOW);
    digitalWrite(PORT_DR_IN, LOW);
    digitalWrite(PORT_ALE_IN, LOW);
    digitalWrite(PORT_LAMP, LOW);
}

void PrintTime(String &str, int flag)
{
    char tmp_str[10] = {0};
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    if (flag == 0)
    {
        sprintf(tmp_str, "%02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);
    }
    else
    {
        sprintf(tmp_str, "%02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);
    }

    str = tmp_str;
}

void printTimeLEDMatrix()
{
    static int flag = 0;
    String str;
    uint8_t time_font_buf[8][16] = {0};
    uint8_t time_font_color[8] = {G, G, O, G, G, O, G, G};

    flag = ~flag;
    PrintTime(str, flag);

    uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, time_font_buf);
    printLEDMatrix(sj_length, time_font_buf, time_font_color);
}

void blink()
{
    printTimeLEDMatrix();
}

void connecting()
{
    uint16_t sj_length = 0;
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, O};

    static int num = 0;

    num = ~num;

    if (num)
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("init   .", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("init    ", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
}

void printConnected()
{
    uint16_t sj_length = 0;
    uint8_t font_buf[32][16] = {0};
    uint8_t font_color1[32] = {G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G};

    sj_length = SFR.StrDirect_ShinoFNT_readALL(MSG_CONNECTED, font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);

    sj_length = SFR.StrDirect_ShinoFNT_readALL("        " + WiFi.localIP().toString(), font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);
}

void print_blank()
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};
    printLEDMatrix(8, _font_buf, _font_color);
}

void clearLEDMatrix()
{
    print_blank();
    print_blank();
}

void printStatic(String str)
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};

    if (str.length() < 9)
    {
        log_i("str : %s", str.c_str());
        uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        log_e("couldn't set string. string length : %d", str.length());
    }
}

void initFont()
{
    SFR.SPIFFS_Shinonome_Init3F(UTF8SJIS_FILE.c_str(), SHINO_HALF_FONT_FILE.c_str(), DUMMY.c_str());
}

void initLEDMatrix()
{
    initFont();

    setAllPortOutput();
    setAllPortLow();

    digitalWrite(PORT_SE_IN, HIGH); //to change manual mode

    print_blank();
    print_blank();
}

bool check_clock_enable(uint8_t start_hour, uint8_t end_hour)
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    log_i("HH:MM:SS = %02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);

    if (start_hour <= tm->tm_hour && tm->tm_hour < end_hour)
    {
        return true;
    }
    else
    {
        return false;
    }
}

void checkSensor()
{
    message = MESSAGE::MSG_COMMAND_GET_SENSOR_DATA;
}

void stopClock()
{
    clocker.detach();
}

void startClock()
{
    clocker.attach_ms(500, blink);
}

void check_clock()
{
    if (check_clock_enable(CLOCK_EN_S, CLOCK_EN_E))
    {
        message = MESSAGE::MSG_COMMAND_START_CLOCK;
    }
    else
    {
        initLEDMatrix();
        stopClock();
        digitalWrite(PORT_LAMP, LOW);
    }
}

String getSensorInfo(String hostName, String uri)
{
    String jsonBody;
    HTTPClient http;

    long oldTime = millis();
    log_i("START getSensorInfo():%dms", millis() - oldTime);
    log_i("Starting connection to %s.local Web server...", hostName.c_str());

    IPAddress ip = MDNS.queryHost(hostName);
    log_i("[%d]Hostname : %s IPaddress : %s", millis() - oldTime, hostName.c_str(), ip.toString().c_str());

    http.begin(ip.toString(), 80, uri);
    int httpCode = http.GET();

    if (httpCode < 0)
    {
        log_e("Connection failed! code : %d", httpCode);
        jsonBody = "";
    }
    else
    {
        log_i("Connected to server! code : %d", httpCode);
        jsonBody = http.getString();
    }

    if (http.connected())
    {
        http.end();
    }

    log_i("END getSensorInfo():%dms", millis() - oldTime);

    return jsonBody;
}

bool WaitSeconds(int second)
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    if (tm->tm_sec == second)
    {
        return false;
    }

    return true;
}

void initClock()
{
    //Get NTP Time
    configTzTime("JST-9", "ntp.nict.jp", "ntp.jst.mfeed.ad.jp");
    delay(2000);

    while (WaitSeconds(0))
    {
        delay(100);
        yield();
    }

    check_clock();
    clockChecker.attach(60, check_clock);

    while (WaitSeconds(30))
    {
        delay(100);
        yield();
    }

    //sensorChecker.attach(60, checkSensor);
}

void printTemperature()
{
    char buffer[10] = {0};
    float _temperature = doc["temperatur"]; // 21.93
    sprintf(buffer, "T:%4.1f*C", _temperature);
    log_i("temperature : [%s]", String(buffer));

    printStatic(String(buffer));
}

void printPressure()
{
    char buffer[10] = {0};
    float _pressure = doc["pressur"]; // 1015.944
    sprintf(buffer, "P:%6.1f", _pressure);
    log_i("pressure : [%s]", String(buffer).c_str());

    printStatic(String(buffer));
}

void printHumidity()
{
    char buffer[10] = {0};
    float _humidity = doc["humidity"]; // 39.27832
    sprintf(buffer, "H:%5.1f%%", _humidity);
    log_i("humidity : [%s]", String(buffer).c_str());

    printStatic(String(buffer));
}

void getBME280Info()
{
    String json = getSensorInfo(DIST_HOSTNAME, APIURI);
    if (json == "")
    {
        if (retry < 2)
        {
            retry++;
            checkSensor();
            delay(3000);
            return;
        }
        else
        {
            retry = 0;
            return;
        }
    }
    else
    {
        retry = 0;

        log_d("Body = %s", json.c_str());
        deserializeJson(doc, json);

        ESPUI.updateControlValue(timeLabelId, makeCreateTime());
        ESPUI.updateControlValue(temperatureLabelId, String((float)doc["temperatur"]) + String(" °C"));
        ESPUI.updateControlValue(humidityLabelId, String((float)doc["humidity"]) + String(" %"));
        ESPUI.updateControlValue(pressurLabelId, String((float)doc["pressur"]) + String(" hPa"));
    }
}

void selectHour(Control *sender, int value)
{
    log_d("Select: ID: %d, Value: %d", sender->id, sender->value);
}

void selectMinuit(Control *sender, int value)
{
    log_d("Select: ID: %d, Value: %d", sender->id, sender->value);
}

void initESPUI()
{
    ESPUI.setVerbosity(Verbosity::Quiet);

    uint16_t hour = ESPUI.addControl(ControlType::Select, "Hour", "", ControlColor::Alizarin, Control::noParent, &selectHour);
    ESPUI.addControl(ControlType::Option, "6 am", "6", ControlColor::Alizarin, hour);
    ESPUI.addControl(ControlType::Option, "7 am", "7", ControlColor::Alizarin, hour);
    ESPUI.addControl(ControlType::Option, "8 am", "8", ControlColor::Alizarin, hour);

    uint16_t minuit = ESPUI.addControl(ControlType::Select, "Minuit", "", ControlColor::Alizarin, Control::noParent, &selectMinuit);
    ESPUI.addControl(ControlType::Option, "0", "0", ControlColor::Alizarin, minuit);
    ESPUI.addControl(ControlType::Option, "10", "10", ControlColor::Alizarin, minuit);
    ESPUI.addControl(ControlType::Option, "20", "20", ControlColor::Alizarin, minuit);
    ESPUI.addControl(ControlType::Option, "30", "30", ControlColor::Alizarin, minuit);
    ESPUI.addControl(ControlType::Option, "40", "40", ControlColor::Alizarin, minuit);
    ESPUI.addControl(ControlType::Option, "50", "50", ControlColor::Alizarin, minuit);

