riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    ESPUI.begin("LAMP Alarm Clock Setting");
}

String getSensorDeviceName()
{
    return "BME280";
}

const char HEX_CHAR_ARRAY[17] = "0123456789ABCDEF";
/**
* convert char array (hex values) to readable string by seperator
* buf:           buffer to convert
* length:        data length
* strSeperator   seperator between each hex value
* return:        formated value as String
*/
String byteToHexString(uint8_t *buf, uint8_t length, String strSeperator = "-")
{
    String dataString = "";
    for (uint8_t i = 0; i < length; i++)
    {
        byte v = buf[i] / 16;
        byte w = buf[i] % 16;
        if (i > 0)
        {
            dataString += strSeperator;
        }
        dataString += String(HEX_CHAR_ARRAY[v]);
        dataString += String(HEX_CHAR_ARRAY[w]);
    }
    dataString.toUpperCase();
    return dataString;
} // byteToHexString

String _getESP32ChipID()
{
    uint64_t chipid;
    chipid = ESP.getEfuseMac(); //The chip ID is essentially its MAC address(length: 6 bytes).
    int chipid_size = 6;
    uint8_t chipid_arr[chipid_size];
    for (uint8_t i = 0; i < chipid_size; i++)
    {
        chipid_arr[i] = (chipid >> (8 * i)) & 0xff;
    }
    return byteToHexString(chipid_arr, chipid_size, ":");
}

String makeJsonResponse(String selfApiURI, String nextApiURI, String status)
{
    String response;

    StaticJsonDocument<384> _local;

    _local["cip_id"] = _getESP32ChipID();
    _local["created_at"] = makeCreateTime();

    JsonObject _links = _local.createNestedObject("_links");

    _links["self"]["href"] = selfApiURI;
    _links["next"]["href"] = nextApiURI;

    JsonObject _embedded_sensor_1 = _local["_embedded"]["sensor"].createNestedObject("1");
    _embedded_sensor_1["device_name"] = getSensorDeviceName();
    _embedded_sensor_1["temperature"] = doc["temperatur"];
    _embedded_sensor_1["humidity"] = doc["humidity"];
    _embedded_sensor_1["pressure"] = doc["pressur"];
    _embedded_sensor_1["status"] = status;

    serializeJson(_local, response);

    return response;
}

void initWebServer()
{
    //g_server = stb.getAsyncWebServerPtr();

    if (g_server != nullptr)
    {
        makeJsonResponse("", "", "");

        g_server->on(sensors_all.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
                     {
                         log_d("[HTTP_GET] %s", sensors_all.c_str());
                         String response = makeJsonResponse(sensors_all, sensors_temperature, "online");
                         request->send(200, "application/json; charset=UTF-8", response);
                     });

        g_server->on(sensors_temperature.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
                     {
                         log_d("[HTTP_GET] %s", sensors_temperature.c_str());

                         request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
                     });

        g_server->on(sensors_humidity.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
                     {
                         log_d("[HTTP_GET] %s", sensors_humidity.c_str());

                         request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
                     });

        g_server->on(sensors_pressure.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
                     {
                         log_d("[HTTP_GET] %s", sensors_pressure.c_str());

                         request->send(200, "application/json; charset=UTF-8", "{\"code\": 200}");
                     });
    }
}

void setup()
{
    initLEDMatrix();

    connectBlinker.attach_ms(500, connecting);

    stb.setHostname(HOSTNAME);
    stb.setTargetHostname(DIST_HOSTNAME);
    stb.setApName(AP_NAME);
    stb.begin(false, false);

    initClock();
    initESPUI();

    connectBlinker.detach();

    print_blank();
    print_blank();
}

void loop()
{
    if (stb.handle() == false)
    {
        switch (message)
        {
        case MESSAGE::MSG_COMMAND_GET_SENSOR_DATA:

            getBME280Info();
            message = MESSAGE::MSG_COMMAND_NOTHING;
            break;
        case MESSAGE::MSG_COMMAND_PRINT_TEMPERATURE_VALUE:

            printTemperature();
            delay(3000);
            message = MESSAGE::MSG_COMMAND_PRINT_HUMIDITY_VALUE;
            break;
        case MESSAGE::MSG_COMMAND_PRINT_HUMIDITY_VALUE:

            printHumidity();
            delay(3000);
            message = MESSAGE::MSG_COMMAND_PRINT_PRESSURE_VALUE;
            break;
        case MESSAGE::MSG_COMMAND_PRINT_PRESSURE_VALUE:

            printPressure();
            delay(3000);
            message = MESSAGE::MSG_COMMAND_START_CLOCK;
            break;
        case MESSAGE::MSG_COMMAND_START_CLOCK:
            digitalWrite(PORT_LAMP, HIGH);
            startClock();
            message = MESSAGE::MSG_COMMAND_NOTHING;
            break;
        case MESSAGE::MSG_COMMAND_STOP_CLOCK:

            stopClock();
            message = MESSAGE::MSG_COMMAND_PRINT_TEMPERATURE_VALUE;
            break;
#ifdef ESP32_BLE
        case MESSAGE::MSG_COMMAND_BLE_INIT:
            initBLE();
            break;
        case MESSAGE::MSG_COMMAND_BLE_DO_CONNECT:
            log_i("We wish to connect BLE Server. pServerAddress = 0x%x", pServerAddress);
            // We have scanned for and found the desired BLE Server with which we wish to connect.
            // Now we connect to it. Once we are connected we set "MSG_COMMAND_BLE_CONNECTED"
            if (connectToServer(*pServerAddress))
            {
                log_i("We are now connected to the BLE Server");
                message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
            }
            else
            {
                log_i("We have failed to connect to the server; there is nothing more we will do.");
                message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
            }
            break;
        case MESSAGE::MSG_COMMAND_BLE_CONNECTED:
            log_i("We are connected to a peer BLE Server");
            // If we are connected to a peer BLE Server, update the characteristic each time we are reached
            // with the current time since boot.

            //String newValue = "Time since boot: " + String(millis() / 1000);
            //log_i("Setting new characteristic value to \"%s\"", newValue.c_str());

            // Set the characteristic's value to be the array of bytes that is actually a string.
            //pRemoteCharacteristic->writeValue(newValue.c_str(), newValue.length());
            message = MESSAGE::MSG_COMMAND_NOTHING;
            break;
        case MESSAGE::MSG_COMMAND_BLE_DISCONNECTED:
            log_i("Disconnected our service");

            //TODO LED ON or OFF? To indicate for human.
            message = MESSAGE::MSG_COMMAND_BLE_INIT;
            break;
        case MESSAGE::MSG_COMMAND_BLE_NOT_FOUND:
            log_i("Not found our service");

            //TODO LED ON or OFF? To indicate for human.
            message = MESSAGE::MSG_COMMAND_NOTHING;
            break;
#endif
        case MESSAGE::MSG_COMMAND_NOTHING:
        default:; //nothing
        }
    }

    yield();
}
